{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "flattend2_model_early", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "bitboard"}, "name": "bitboard", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "board_encoder/conv_block_0/conv_block_0_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "board_encoder/conv_block_0/conv_block_0_conv", "inbound_nodes": [[["bitboard", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "board_encoder/conv_block_0/conv_block_0_batchnorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "board_encoder/conv_block_0/conv_block_0_batchnorm", "inbound_nodes": [[["board_encoder/conv_block_0/conv_block_0_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "board_encoder/residual_conv_0", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "board_encoder/residual_conv_0", "inbound_nodes": [[["bitboard", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "name": "add_6", "inbound_nodes": [[["board_encoder/conv_block_0/conv_block_0_batchnorm", 0, 0, {}], ["board_encoder/residual_conv_0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "board_encoder/conv_block_1/conv_block_1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "board_encoder/conv_block_1/conv_block_1_conv", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "board_encoder/conv_block_1/conv_block_1_batchnorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "board_encoder/conv_block_1/conv_block_1_batchnorm", "inbound_nodes": [[["board_encoder/conv_block_1/conv_block_1_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "board_encoder/residual_conv_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "board_encoder/residual_conv_1", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["board_encoder/conv_block_1/conv_block_1_batchnorm", 0, 0, {}], ["board_encoder/residual_conv_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_13", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "board_encoder/conv_block_2/conv_block_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "board_encoder/conv_block_2/conv_block_2_conv", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "board_encoder/conv_block_2/conv_block_2_batchnorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "board_encoder/conv_block_2/conv_block_2_batchnorm", "inbound_nodes": [[["board_encoder/conv_block_2/conv_block_2_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "board_encoder/residual_conv_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "board_encoder/residual_conv_2", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "name": "add_8", "inbound_nodes": [[["board_encoder/conv_block_2/conv_block_2_batchnorm", 0, 0, {}], ["board_encoder/residual_conv_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_14", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_5", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "features"}, "name": "features", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["flatten_5", 0, 0, {}], ["features", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "lin_classifier/lin_dense_0", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lin_classifier/lin_dense_0", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "lin_classifier/lin_batch_norm_0", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "lin_classifier/lin_batch_norm_0", "inbound_nodes": [[["lin_classifier/lin_dense_0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_15", "inbound_nodes": [[["lin_classifier/lin_batch_norm_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "lin_classifier/lin_dense_1", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lin_classifier/lin_dense_1", "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "lin_classifier/lin_batch_norm_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "lin_classifier/lin_batch_norm_1", "inbound_nodes": [[["lin_classifier/lin_dense_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_16", "inbound_nodes": [[["lin_classifier/lin_batch_norm_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "lin_classifier/lin_dense_2", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lin_classifier/lin_dense_2", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "lin_classifier/lin_batch_norm_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "lin_classifier/lin_batch_norm_2", "inbound_nodes": [[["lin_classifier/lin_dense_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_17", "inbound_nodes": [[["lin_classifier/lin_batch_norm_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output_layer1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_layer1", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}], "input_layers": [["bitboard", 0, 0], ["features", 0, 0]], "output_layers": [["output_layer1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "board_encoder/conv_block_0/conv_block_0_batchnorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "board_encoder/conv_block_0/conv_block_0_batchnorm/beta", "shape": [32], "dtype": "float32"}, {"name": "board_encoder/conv_block_0/conv_block_0_batchnorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "board_encoder/conv_block_0/conv_block_0_batchnorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "board_encoder/conv_block_0/conv_block_0_conv/kernel", "shape": [3, 3, 12, 32], "dtype": "float32"}, {"name": "board_encoder/conv_block_0/conv_block_0_conv/bias", "shape": [32], "dtype": "float32"}, {"name": "board_encoder/conv_block_1/conv_block_1_batchnorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "board_encoder/conv_block_1/conv_block_1_batchnorm/beta", "shape": [64], "dtype": "float32"}, {"name": "board_encoder/conv_block_1/conv_block_1_batchnorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "board_encoder/conv_block_1/conv_block_1_batchnorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "board_encoder/conv_block_1/conv_block_1_conv/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "board_encoder/conv_block_1/conv_block_1_conv/bias", "shape": [64], "dtype": "float32"}, {"name": "board_encoder/conv_block_2/conv_block_2_batchnorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "board_encoder/conv_block_2/conv_block_2_batchnorm/beta", "shape": [128], "dtype": "float32"}, {"name": "board_encoder/conv_block_2/conv_block_2_batchnorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "board_encoder/conv_block_2/conv_block_2_batchnorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "board_encoder/conv_block_2/conv_block_2_conv/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "board_encoder/conv_block_2/conv_block_2_conv/bias", "shape": [128], "dtype": "float32"}, {"name": "board_encoder/residual_conv_0/kernel", "shape": [1, 1, 12, 32], "dtype": "float32"}, {"name": "board_encoder/residual_conv_0/bias", "shape": [32], "dtype": "float32"}, {"name": "board_encoder/residual_conv_1/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "board_encoder/residual_conv_1/bias", "shape": [64], "dtype": "float32"}, {"name": "board_encoder/residual_conv_2/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "board_encoder/residual_conv_2/bias", "shape": [128], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_0/gamma", "shape": [1024], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_0/beta", "shape": [1024], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_0/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_0/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_1/gamma", "shape": [512], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_1/beta", "shape": [512], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_2/gamma", "shape": [256], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_2/beta", "shape": [256], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "lin_classifier/lin_batch_norm_2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "lin_classifier/lin_dense_0/kernel", "shape": [8196, 1024], "dtype": "float32"}, {"name": "lin_classifier/lin_dense_0/bias", "shape": [1024], "dtype": "float32"}, {"name": "lin_classifier/lin_dense_1/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "lin_classifier/lin_dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "lin_classifier/lin_dense_2/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "lin_classifier/lin_dense_2/bias", "shape": [256], "dtype": "float32"}, {"name": "output_layer1/kernel", "shape": [256, 1], "dtype": "float32"}, {"name": "output_layer1/bias", "shape": [1], "dtype": "float32"}]}]}